#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/learning-for-good/gh-actions/runs/run-cjP2gFcugTeQdS1w

Waiting for the plan to start...

Terraform v1.4.2
on linux_amd64
Initializing plugins and modules...
aws_default_subnet.default_subnet_b: Refreshing state... [id=subnet-4d372234]
aws_default_subnet.default_subnet_a: Refreshing state... [id=subnet-865264cd]
aws_ecs_cluster.helloworld_cluster: Refreshing state... [id=arn:aws:ecs:us-west-2:515319413396:cluster/helloworld]
aws_default_subnet.default_subnet_d: Refreshing state... [id=subnet-d2c35cf9]
aws_ecr_repository.hello_world_repo: Refreshing state... [id=helloworld]
aws_default_vpc.default_vpc: Refreshing state... [id=vpc-b960d8c1]
aws_default_subnet.default_subnet_c: Refreshing state... [id=subnet-5c0eea01]
aws_security_group.load_balancer_security_group: Refreshing state... [id=sg-0f8064aeda3addf80]
aws_security_group.service_security_group: Refreshing state... [id=sg-0d4309a5eaaec6550]
aws_alb.application_load_balancer: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-2:515319413396:loadbalancer/app/helloworld-lb/ac511d17b77af5e3]
aws_lb_target_group.target_group: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-2:515319413396:targetgroup/target-group/39435a0e37a8b86c]
aws_lb_listener.listener: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-2:515319413396:listener/app/helloworld-lb/ac511d17b77af5e3/6cdc0c062c525210]
aws_lb_listener.listener: Drift detected (update)
aws_alb.application_load_balancer: Drift detected (update)
aws_security_group.service_security_group: Drift detected (update)
aws_default_subnet.default_subnet_c: Drift detected (update)
aws_default_subnet.default_subnet_d: Drift detected (update)
aws_default_vpc.default_vpc: Drift detected (update)
aws_security_group.load_balancer_security_group: Drift detected (update)
aws_default_subnet.default_subnet_a: Drift detected (update)
aws_default_subnet.default_subnet_b: Drift detected (update)
aws_ecs_cluster.helloworld_cluster: Drift detected (update)
aws_ecr_repository.hello_world_repo: Drift detected (update)
aws_lb_target_group.target_group: Drift detected (update)
╷
│ Warning: Value for undeclared variable
│
│ The root module does not declare a variable named "AWS_ACCESS_KEY_ID" but a
│ value was found in file
│ "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-cjP2gFcugTeQdS1w/terraform.tfvars".
│ If you meant to use this value, add a "variable" block to the
│ configuration.
│
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│
│ The root module does not declare a variable named "AWS_SECRET_ACCESS_KEY"
│ but a value was found in file
│ "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-cjP2gFcugTeQdS1w/terraform.tfvars".
│ If you meant to use this value, add a "variable" block to the
│ configuration.
│
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_ecs_service.helloworld_service will be created
  + resource "aws_ecs_service" "helloworld_service" {
      + cluster                            = "arn:aws:ecs:us-west-2:515319413396:cluster/helloworld"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 3
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "helloworld-service"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = (known after apply)
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "helloworld-task"
          + container_port   = 3000
          + target_group_arn = "arn:aws:elasticloadbalancing:us-west-2:515319413396:targetgroup/target-group/39435a0e37a8b86c"
        }

      + network_configuration {
          + assign_public_ip = true
          + security_groups  = [
              + "sg-0d4309a5eaaec6550",
            ]
          + subnets          = [
              + "subnet-4d372234",
              + "subnet-5c0eea01",
              + "subnet-865264cd",
              + "subnet-d2c35cf9",
            ]
        }
    }

  # aws_ecs_task_definition.helloworld_task will be created
  + resource "aws_ecs_task_definition" "helloworld_task" {
      + arn                      = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + cpu          = 256
                  + essential    = true
                  + image        = "515319413396.dkr.ecr.us-west-2.amazonaws.com/helloworld"
                  + memory       = 512
                  + name         = "helloworld-task"
                  + portMappings = [
                      + {
                          + containerPort = 3000
                          + hostPort      = 3000
                        },
                    ]
                },
            ]
        )
      + cpu                      = "256"
      + execution_role_arn       = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"
      + family                   = "helloworld-task"
      + id                       = (known after apply)
      + memory                   = "512"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags_all                 = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

```

</details>

*Pushed by: @SunnyAgrawal, Action: `pull_request`*